      * meu primeiro programa COBOL
       IDENTIFICATION DIVISION.
      * INCLUSÃO DE INFORMAÇÕES DOCUMENTAIS
       PROGRAM-ID. HELLO.
       ENVIRONMENT DIVISION
      *DESCREVE O COMPUTADOR ONDE O PROGRAMA ESTÁ SENDO DESCRITO
       DATA DIVISION.
      *ARQUIVOS DE ENTRADA E SAIDA, VARIAVEIS E CONSTANTES
       PROCEDURE DIVISION.
      *CONTÉM O CÓDIGO QUE IRÁ MANIPULAR OS DADOS E INCLUIR O ALGORITMO
      * DO PROGRAMA
               DISPLAY "HELLO WORLD".
               STOP RUN.
               